nxp-appcodehub/an-mc-pmsm-mcxe247/startup/startup_mcxe247.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    0,                                 // Reserved
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level - MCXE247
    DMA0_IRQHandler,                 // 16 : DMA channel 0 transfer complete
    DMA1_IRQHandler,                 // 17 : DMA channel 1 transfer complete
    DMA2_IRQHandler,                 // 18 : DMA channel 2 transfer complete
    DMA3_IRQHandler,                 // 19 : DMA channel 3 transfer complete
    DMA4_IRQHandler,                 // 20 : DMA channel 4 transfer complete
    DMA5_IRQHandler,                 // 21 : DMA channel 5 transfer complete
    DMA6_IRQHandler,                 // 22 : DMA channel 6 transfer complete
    DMA7_IRQHandler,                 // 23 : DMA channel 7 transfer complete
    DMA8_IRQHandler,                 // 24 : DMA channel 8 transfer complete
    DMA9_IRQHandler,                 // 25 : DMA channel 9 transfer complete
    DMA10_IRQHandler,                // 26 : DMA channel 10 transfer complete
    DMA11_IRQHandler,                // 27 : DMA channel 11 transfer complete
    DMA12_IRQHandler,                // 28 : DMA channel 12 transfer complete
    DMA13_IRQHandler,                // 29 : DMA channel 13 transfer complete
    DMA14_IRQHandler,                // 30 : DMA channel 14 transfer complete
    DMA15_IRQHandler,                // 31 : DMA channel 15 transfer complete
    DMA_Error_IRQHandler,            // 32 : DMA error interrupt channels 0-15
    MCM_IRQHandler,                  // 33 : FPU sources
    FTFC_CMD_IRQHandler,             // 34 : FTFC Command complete
    FTFC_Read_Collision_IRQHandler,  // 35 : FTFC Read collision
    LVD_LVW_IRQHandler,              // 36 : PMC Low voltage detect interrupt
    FTFM_Fault_IRQHandler,           // 37 : FTFM Double bit fault detect
    WDOG_EWM_IRQHandler,             // 38 : Interrupt request out before WDOG reset out, EWM output as interrupt
    RCM_IRQHandler,                  // 39 : RCM Asynchronous Interrupt
    LPI2C0_Master_IRQHandler,        // 40 : LPI2C0 Master Interrupt
    LPI2C0_Slave_IRQHandler,         // 41 : LPI2C0 Slave Interrupt
    LPSPI0_IRQHandler,               // 42 : LPSPI0 Interrupt
    LPSPI1_IRQHandler,               // 43 : LPSPI1 Interrupt
    LPSPI2_IRQHandler,               // 44 : LPSPI2 Interrupt
    LPI2C1_Master_IRQHandler,        // 45 : LPI2C1 Master Interrupt
    LPI2C1_Slave_IRQHandler,         // 46 : LPI2C1 Slave Interrupt
    LPUART0_IRQHandler,              // 47 : Low-Power Universal Asynchronous Receive/Transmit interrupt
    Reserved48_IRQHandler,           // 48 : Reserved interrupt
    LPUART1_IRQHandler,              // 49 : Low-Power Universal Asynchronous Receive/Transmit interrupt
    Reserved50_IRQHandler,           // 50 : Reserved interrupt
    LPUART2_IRQHandler,              // 51 : Low-Power Universal Asynchronous Receive/Transmit interrupt
    Reserved52_IRQHandler,           // 52 : Reserved interrupt
    Reserved53_IRQHandler,           // 53 : Reserved interrupt
    Reserved54_IRQHandler,           // 54 : Reserved interrupt
    ADC0_IRQHandler,                 // 55 : Analog-to-Digital Converter interrupt
    ADC1_IRQHandler,                 // 56 : Analog-to-Digital Converter interrupt
    CMP0_IRQHandler,                 // 57 : Comparator interrupt
    Reserved58_IRQHandler,           // 58 : Reserved interrupt
    Reserved59_IRQHandler,           // 59 : Reserved interrupt
    ERM_single_fault_IRQHandler,     // 60 : ERM single bit error correction
    ERM_double_fault_IRQHandler,     // 61 : ERM double bit error non-correctable
    RTC_IRQHandler,                  // 62 : RTC alarm interrupt
    RTC_Seconds_IRQHandler,          // 63 : RTC seconds interrupt
    LPIT0_Ch0_IRQHandler,            // 64 : LPIT0 channel 0 overflow interrupt
    LPIT0_Ch1_IRQHandler,            // 65 : LPIT0 channel 1 overflow interrupt
    LPIT0_Ch2_IRQHandler,            // 66 : LPIT0 channel 2 overflow interrupt
    LPIT0_Ch3_IRQHandler,            // 67 : LPIT0 channel 3 overflow interrupt
    PDB0_IRQHandler,                 // 68 : PDB0 interrupt
    Reserved69_IRQHandler,           // 69 : Reserved interrupt
    Reserved70_IRQHandler,           // 70 : Reserved interrupt
    I2S1_Tx_IRQHandler,              // 71 : Transmit Synchronous interupt (for interrupt controller)
    I2S1_Rx_IRQHandler,              // 72 : Transmit Synchronous interupt (for interrupt controller)
    SCG_IRQHandler,                  // 73 : SCG bus interrupt request
    LPTMR0_IRQHandler,               // 74 : LPTIMER interrupt request
    PORTA_IRQHandler,                // 75 : Port A pin detect interrupt
    PORTB_IRQHandler,                // 76 : Port B pin detect interrupt
    PORTC_IRQHandler,                // 77 : Port C pin detect interrupt
    PORTD_IRQHandler,                // 78 : Port D pin detect interrupt
    PORTE_IRQHandler,                // 79 : Port E pin detect interrupt
    SWI_IRQHandler,                  // 80 : Software interrupt
    QSPI_Ored_IRQHandler,            // 81 : All interrupts ORed output
    Reserved82_IRQHandler,           // 82 : Reserved interrupt
    Reserved83_IRQHandler,           // 83 : Reserved interrupt
    PDB1_IRQHandler,                 // 84 : PDB1 interrupt
    FLEXIO_IRQHandler,               // 85 : Software interrupt
    I2S0_Tx_IRQHandler,              // 86 : Transmit Synchronous interupt (for interrupt controller)
    I2S0_Rx_IRQHandler,              // 87 : Transmit Synchronous interupt (for interrupt controller)
    ENET_1588_Timer_IRQHandler,      // 88 : Ethernet MAC IEEE 1588 Timer Interrupt
    ENET_Transmit_IRQHandler,        // 89 : Ethernet MAC Transmit Interrupt
    ENET_Receive_IRQHandler,         // 90 : Ethernet MAC Receive Interrupt
    ENET_Error_IRQHandler,           // 91 : Ethernet MAC Error and miscelaneous Interrupt
    ENET_Graceful_Stop_IRQHandler,   // 92 : Ethernet MAC graceful stop Interrupt
    ENET_Wake_IRQHandler,            // 93 : Ethernet MAC wake from sleep Interrupt
    CAN0_ORed_IRQHandler,            // 94 : CAN0 OR'ed interrupt
    CAN0_Error_IRQHandler,           // 95 : CAN0 Interrupt indicating that errors were detected on the CAN bus
    CAN0_Wake_Up_IRQHandler,         // 96 : CAN0 Interrupt asserted when Pretended Networking operation is enabled, and a valid message matches the selected filter criteria during Low Power mode
    CAN0_ORed_0_15_MB_IRQHandler,    // 97 : CAN0 OR'ed Message buffer (0-15)
    CAN0_ORed_16_31_MB_IRQHandler,   // 98 : CAN0 OR'ed Message buffer (16-31)
    Reserved99_IRQHandler,           // 99 : Reserved interrupt
    Reserved100_IRQHandler,          // 100: Reserved interrupt
    CAN1_ORed_IRQHandler,            // 101: CAN1 OR'ed interrupt
    CAN1_Error_IRQHandler,           // 102: CAN1 Interrupt indicating that errors were detected on the CAN bus
    Reserved103_IRQHandler,          // 103: Reserved interrupt
    CAN1_ORed_0_15_MB_IRQHandler,    // 104: CAN1 OR'ed Message buffer (0-15)
    CAN1_ORed_16_31_MB_IRQHandler,   // 105: CAN1 OR'ed Message buffer (16-31)
    Reserved106_IRQHandler,          // 106: Reserved interrupt
    Reserved107_IRQHandler,          // 107: Reserved interrupt
    CAN2_ORed_IRQHandler,            // 108: CAN2 OR'ed interrupt
    CAN2_Error_IRQHandler,           // 109: CAN2 Interrupt indicating that errors were detected on the CAN bus
    Reserved110_IRQHandler,          // 110: Reserved interrupt
    CAN2_ORed_0_15_MB_IRQHandler,    // 111: CAN2 OR'ed Message buffer (0-15)
    CAN2_ORed_16_31_MB_IRQHandler,   // 112: CAN2 OR'ed Message buffer (16-31)
    Reserved113_IRQHandler,          // 113: Reserved interrupt
    Reserved114_IRQHandler,          // 114: Reserved interrupt
    FTM0_Ch0_Ch1_IRQHandler,         // 115: FTM0 Channel 0 and 1 interrupt
    FTM0_Ch2_Ch3_IRQHandler,         // 116: FTM0 Channel 2 and 3 interrupt
    FTM0_Ch4_Ch5_IRQHandler,         // 117: FTM0 Channel 4 and 5 interrupt
    FTM0_Ch6_Ch7_IRQHandler,         // 118: FTM0 Channel 6 and 7 interrupt
    FTM0_Fault_IRQHandler,           // 119: FTM0 Fault interrupt
    FTM0_Ovf_Reload_IRQHandler,      // 120: FTM0 Counter overflow and Reload interrupt
    FTM1_Ch0_Ch1_IRQHandler,         // 121: FTM1 Channel 0 and 1 interrupt
    FTM1_Ch2_Ch3_IRQHandler,         // 122: FTM1 Channel 2 and 3 interrupt
    FTM1_Ch4_Ch5_IRQHandler,         // 123: FTM1 Channel 4 and 5 interrupt
    FTM1_Ch6_Ch7_IRQHandler,         // 124: FTM1 Channel 6 and 7 interrupt
    FTM1_Fault_IRQHandler,           // 125: FTM1 Fault interrupt
    FTM1_Ovf_Reload_IRQHandler,      // 126: FTM1 Counter overflow and Reload interrupt
    FTM2_Ch0_Ch1_IRQHandler,         // 127: FTM2 Channel 0 and 1 interrupt
    FTM2_Ch2_Ch3_IRQHandler,         // 128: FTM2 Channel 2 and 3 interrupt
    FTM2_Ch4_Ch5_IRQHandler,         // 129: FTM2 Channel 4 and 5 interrupt
    FTM2_Ch6_Ch7_IRQHandler,         // 130: FTM2 Channel 6 and 7 interrupt
    FTM2_Fault_IRQHandler,           // 131: FTM2 Fault interrupt
    FTM2_Ovf_Reload_IRQHandler,      // 132: FTM2 Counter overflow and Reload interrupt
    FTM3_Ch0_Ch1_IRQHandler,         // 133: FTM3 Channel 0 and 1 interrupt
    FTM3_Ch2_Ch3_IRQHandler,         // 134: FTM3 Channel 2 and 3 interrupt
    FTM3_Ch4_Ch5_IRQHandler,         // 135: FTM3 Channel 4 and 5 interrupt
    FTM3_Ch6_Ch7_IRQHandler,         // 136: FTM3 Channel 6 and 7 interrupt
    FTM3_Fault_IRQHandler,           // 137: FTM3 Fault interrupt
    FTM3_Ovf_Reload_IRQHandler,      // 138: FTM3 Counter overflow and Reload interrupt
    FTM4_Ch0_Ch1_IRQHandler,         // 139: FTM4 Channel 0 and 1 interrupt
    FTM4_Ch2_Ch3_IRQHandler,         // 140: FTM4 Channel 2 and 3 interrupt
    FTM4_Ch4_Ch5_IRQHandler,         // 141: FTM4 Channel 4 and 5 interrupt
    FTM4_Ch6_Ch7_IRQHandler,         // 142: FTM4 Channel 6 and 7 interrupt
    FTM4_Fault_IRQHandler,           // 143: FTM4 Fault interrupt
    FTM4_Ovf_Reload_IRQHandler,      // 144: FTM4 Counter overflow and Reload interrupt
    FTM5_Ch0_Ch1_IRQHandler,         // 145: FTM5 Channel 0 and 1 interrupt
    FTM5_Ch2_Ch3_IRQHandler,         // 146: FTM5 Channel 2 and 3 interrupt
    FTM5_Ch4_Ch5_IRQHandler,         // 147: FTM5 Channel 4 and 5 interrupt
    FTM5_Ch6_Ch7_IRQHandler,         // 148: FTM5 Channel 6 and 7 interrupt
    FTM5_Fault_IRQHandler,           // 149: FTM5 Fault interrupt
    FTM5_Ovf_Reload_IRQHandler,      // 150: FTM5 Counter overflow and Reload interrupt
    FTM6_Ch0_Ch1_IRQHandler,         // 151: FTM6 Channel 0 and 1 interrupt
    FTM6_Ch2_Ch3_IRQHandler,         // 152: FTM6 Channel 2 and 3 interrupt
    FTM6_Ch4_Ch5_IRQHandler,         // 153: FTM6 Channel 4 and 5 interrupt
    FTM6_Ch6_Ch7_IRQHandler,         // 154: FTM6 Channel 6 and 7 interrupt
    FTM6_Fault_IRQHandler,           // 155: FTM6 Fault interrupt
    FTM6_Ovf_Reload_IRQHandler,      // 156: FTM6 Counter overflow and Reload interrupt
    FTM7_Ch0_Ch1_IRQHandler,         // 157: FTM7 Channel 0 and 1 interrupt
    FTM7_Ch2_Ch3_IRQHandler,         // 158: FTM7 Channel 2 and 3 interrupt
    FTM7_Ch4_Ch5_IRQHandler,         // 159: FTM7 Channel 4 and 5 interrupt
    FTM7_Ch6_Ch7_IRQHandler,         // 160: FTM7 Channel 6 and 7 interrupt
    FTM7_Fault_IRQHandler,           // 161: FTM7 Fault interrupt
    FTM7_Ovf_Reload_IRQHandler,      // 162: FTM7 Counter overflow and Reload interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    // Write watchdog update key to unlock
    *((volatile unsigned int *)0x40052004) = 0xD928C520;
    // Set timeout value
    *((volatile unsigned int *)0x40052008) = 0xFFFF;
    // Now disable watchdog via control register
    volatile unsigned int *WDOG_CS = (unsigned int *) 0x40052000;
    *WDOG_CS = (*WDOG_CS & ~(1 << 7)) | (1 << 5);
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

