nxp-appcodehub/an-mc-pmsm-mcxe247/startup/startup_mcxe247.c
WEAK void LPUART1_IRQHandler(void)
{   LPUART1_DriverIRQHandler();
}

WEAK void Reserved50_IRQHandler(void)
{   Reserved50_DriverIRQHandler();
}

WEAK void LPUART2_IRQHandler(void)
{   LPUART2_DriverIRQHandler();
}

WEAK void Reserved52_IRQHandler(void)
{   Reserved52_DriverIRQHandler();
}

WEAK void Reserved53_IRQHandler(void)
{   Reserved53_DriverIRQHandler();
}

WEAK void Reserved54_IRQHandler(void)
{   Reserved54_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{   ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{   ADC1_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{   CMP0_DriverIRQHandler();
}

WEAK void Reserved58_IRQHandler(void)
{   Reserved58_DriverIRQHandler();
}

WEAK void Reserved59_IRQHandler(void)
{   Reserved59_DriverIRQHandler();
}

WEAK void ERM_single_fault_IRQHandler(void)
{   ERM_single_fault_DriverIRQHandler();
}

WEAK void ERM_double_fault_IRQHandler(void)
{   ERM_double_fault_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{   RTC_DriverIRQHandler();
}

WEAK void RTC_Seconds_IRQHandler(void)
{   RTC_Seconds_DriverIRQHandler();
}

WEAK void LPIT0_Ch0_IRQHandler(void)
{   LPIT0_Ch0_DriverIRQHandler();
}

WEAK void LPIT0_Ch1_IRQHandler(void)
{   LPIT0_Ch1_DriverIRQHandler();
}

WEAK void LPIT0_Ch2_IRQHandler(void)
{   LPIT0_Ch2_DriverIRQHandler();
}

WEAK void LPIT0_Ch3_IRQHandler(void)
{   LPIT0_Ch3_DriverIRQHandler();
}

WEAK void PDB0_IRQHandler(void)
{   PDB0_DriverIRQHandler();
}

WEAK void Reserved69_IRQHandler(void)
{   Reserved69_DriverIRQHandler();
}

WEAK void Reserved70_IRQHandler(void)
{   Reserved70_DriverIRQHandler();
}

WEAK void I2S1_Tx_IRQHandler(void)
{   I2S1_Tx_DriverIRQHandler();
}

WEAK void I2S1_Rx_IRQHandler(void)
{   I2S1_Rx_DriverIRQHandler();
}

WEAK void SCG_IRQHandler(void)
{   SCG_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{   LPTMR0_DriverIRQHandler();
}

WEAK void PORTA_IRQHandler(void)
{   PORTA_DriverIRQHandler();
}

WEAK void PORTB_IRQHandler(void)
{   PORTB_DriverIRQHandler();
}

WEAK void PORTC_IRQHandler(void)
{   PORTC_DriverIRQHandler();
}

WEAK void PORTD_IRQHandler(void)
{   PORTD_DriverIRQHandler();
}

WEAK void PORTE_IRQHandler(void)
{   PORTE_DriverIRQHandler();
}

WEAK void SWI_IRQHandler(void)
{   SWI_DriverIRQHandler();
}

WEAK void QSPI_Ored_IRQHandler(void)
{   QSPI_Ored_DriverIRQHandler();
}

WEAK void Reserved82_IRQHandler(void)
{   Reserved82_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{   Reserved83_DriverIRQHandler();
}

WEAK void PDB1_IRQHandler(void)
{   PDB1_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{   FLEXIO_DriverIRQHandler();
}

WEAK void I2S0_Tx_IRQHandler(void)
{   I2S0_Tx_DriverIRQHandler();
}

WEAK void I2S0_Rx_IRQHandler(void)
{   I2S0_Rx_DriverIRQHandler();
}

WEAK void ENET_1588_Timer_IRQHandler(void)
{   ENET_1588_Timer_DriverIRQHandler();
}

WEAK void ENET_Transmit_IRQHandler(void)
{   ENET_Transmit_DriverIRQHandler();
}

WEAK void ENET_Receive_IRQHandler(void)
{   ENET_Receive_DriverIRQHandler();
}

WEAK void ENET_Error_IRQHandler(void)
{   ENET_Error_DriverIRQHandler();
}

WEAK void ENET_Graceful_Stop_IRQHandler(void)
{   ENET_Graceful_Stop_DriverIRQHandler();
}

WEAK void ENET_Wake_IRQHandler(void)
{   ENET_Wake_DriverIRQHandler();
}

WEAK void CAN0_ORed_IRQHandler(void)
{   CAN0_ORed_DriverIRQHandler();
}

WEAK void CAN0_Error_IRQHandler(void)
{   CAN0_Error_DriverIRQHandler();
}

WEAK void CAN0_Wake_Up_IRQHandler(void)
{   CAN0_Wake_Up_DriverIRQHandler();
}

WEAK void CAN0_ORed_0_15_MB_IRQHandler(void)
{   CAN0_ORed_0_15_MB_DriverIRQHandler();
}

WEAK void CAN0_ORed_16_31_MB_IRQHandler(void)
{   CAN0_ORed_16_31_MB_DriverIRQHandler();
}

WEAK void Reserved99_IRQHandler(void)
{   Reserved99_DriverIRQHandler();
}

WEAK void Reserved100_IRQHandler(void)
{   Reserved100_DriverIRQHandler();
}

WEAK void CAN1_ORed_IRQHandler(void)
{   CAN1_ORed_DriverIRQHandler();
}

WEAK void CAN1_Error_IRQHandler(void)
{   CAN1_Error_DriverIRQHandler();
}

WEAK void Reserved103_IRQHandler(void)
{   Reserved103_DriverIRQHandler();
}

WEAK void CAN1_ORed_0_15_MB_IRQHandler(void)
{   CAN1_ORed_0_15_MB_DriverIRQHandler();
}

WEAK void CAN1_ORed_16_31_MB_IRQHandler(void)
{   CAN1_ORed_16_31_MB_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{   Reserved106_DriverIRQHandler();
}

WEAK void Reserved107_IRQHandler(void)
{   Reserved107_DriverIRQHandler();
}

WEAK void CAN2_ORed_IRQHandler(void)
{   CAN2_ORed_DriverIRQHandler();
}

WEAK void CAN2_Error_IRQHandler(void)
{   CAN2_Error_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{   Reserved110_DriverIRQHandler();
}

WEAK void CAN2_ORed_0_15_MB_IRQHandler(void)
{   CAN2_ORed_0_15_MB_DriverIRQHandler();
}

WEAK void CAN2_ORed_16_31_MB_IRQHandler(void)
{   CAN2_ORed_16_31_MB_DriverIRQHandler();
}

WEAK void Reserved113_IRQHandler(void)
{   Reserved113_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{   Reserved114_DriverIRQHandler();
}

WEAK void FTM0_Ch0_Ch1_IRQHandler(void)
{   FTM0_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM0_Ch2_Ch3_IRQHandler(void)
{   FTM0_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM0_Ch4_Ch5_IRQHandler(void)
{   FTM0_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM0_Ch6_Ch7_IRQHandler(void)
{   FTM0_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM0_Fault_IRQHandler(void)
{   FTM0_Fault_DriverIRQHandler();
}

WEAK void FTM0_Ovf_Reload_IRQHandler(void)
{   FTM0_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM1_Ch0_Ch1_IRQHandler(void)
{   FTM1_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM1_Ch2_Ch3_IRQHandler(void)
{   FTM1_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM1_Ch4_Ch5_IRQHandler(void)
{   FTM1_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM1_Ch6_Ch7_IRQHandler(void)
{   FTM1_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM1_Fault_IRQHandler(void)
{   FTM1_Fault_DriverIRQHandler();
}

WEAK void FTM1_Ovf_Reload_IRQHandler(void)
{   FTM1_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM2_Ch0_Ch1_IRQHandler(void)
{   FTM2_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM2_Ch2_Ch3_IRQHandler(void)
{   FTM2_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM2_Ch4_Ch5_IRQHandler(void)
{   FTM2_Ch4_Ch5_DriverIRQHandler();
}

